In [31]:
import pandas as pd

In [189]:
unmatched = pd.read_csv('./not_match_officer.csv')
all_sworn = pd.read_csv('./all_sworn_officer.csv')

In [231]:
unmatched.ACCUSED_APPOINTMENT_DATE = pd.to_datetime(unmatched.ACCUSED_APPOINTMENT_DATE)

def fix_yr(x):
    split = str(x).split('-')
    if split[-1][0] == '0' or split[-1][0] == '1':
        split[-1] = '20'+split[-1]
    else:
        split[-1] = '19'+split[-1]
    return '-'.join(split)

all_sworn.APPOINTED_DATE = pd.to_datetime(all_sworn.APPOINTED_DATE.apply(fix_yr), 
                                          errors='coerce')

In [261]:
match=[]
no_match=[]
for date in unmatched.ACCUSED_APPOINTMENT_DATE.unique():
    if not all_sworn[all_sworn.APPOINTED_DATE == date].empty:
        match.append(date)
    else:
        no_match.append(date)

In [337]:
print(len(match))
print(len(no_match))

10
19

In [339]:
match = sorted(match)
match

[numpy.datetime64('1980-10-01T00:00:00.000000000'),
 numpy.datetime64('1986-06-16T00:00:00.000000000'),
 numpy.datetime64('1994-08-01T00:00:00.000000000'),
 numpy.datetime64('1994-12-01T00:00:00.000000000'),
 numpy.datetime64('1999-09-13T00:00:00.000000000'),
 numpy.datetime64('2005-12-05T00:00:00.000000000'),
 numpy.datetime64('2006-01-23T00:00:00.000000000'),
 numpy.datetime64('2007-07-30T00:00:00.000000000'),
 numpy.datetime64('2012-04-02T00:00:00.000000000'),
 numpy.datetime64('2012-10-05T00:00:00.000000000')]

In [341]:
no_match = sorted(no_match)
no_match

[numpy.datetime64('1985-06-03T00:00:00.000000000'),
 numpy.datetime64('1988-12-27T00:00:00.000000000'),
 numpy.datetime64('1990-10-22T00:00:00.000000000'),
 numpy.datetime64('1991-08-01T00:00:00.000000000'),
 numpy.datetime64('1991-12-19T00:00:00.000000000'),
 numpy.datetime64('1992-04-16T00:00:00.000000000'),
 numpy.datetime64('1992-05-01T00:00:00.000000000'),
 numpy.datetime64('1992-06-16T00:00:00.000000000'),
 numpy.datetime64('1993-07-01T00:00:00.000000000'),
 numpy.datetime64('1996-08-29T00:00:00.000000000'),
 numpy.datetime64('1997-01-02T00:00:00.000000000'),
 numpy.datetime64('1998-09-16T00:00:00.000000000'),
 numpy.datetime64('2001-12-11T00:00:00.000000000'),
 numpy.datetime64('2003-05-27T00:00:00.000000000'),
 numpy.datetime64('2004-08-31T00:00:00.000000000'),
 numpy.datetime64('2005-09-06T00:00:00.000000000'),
 numpy.datetime64('2011-12-16T00:00:00.000000000'),
 numpy.datetime64('2014-04-16T00:00:00.000000000'),
 numpy.datetime64('2015-10-19T00:00:00.000000000')]

In [272]:
matched_df = pd.concat([unmatched[unmatched.ACCUSED_APPOINTMENT_DATE==date]
                       for date in match])
matched_df

,ACCSUEDOFFICER_FNAME,ACCUSEDOFFICER_LNAME,ACCUSED_STAR,ACCUSED_UNIT,ACCUSED_APPOINTMENT_DATE
0,TRACEY,EDWARDS,4947.0,6.0,2007-07-30
2,RONALD,FORGUE,1600.0,5.0,1986-06-16
4,RONALD,FORGUE,380.0,3.0,1986-06-16
3,KEVIN,CONNORS,1182.0,8.0,1999-09-13
9,JAMEL,JUDEH,NaN,44.0,2012-10-05
11,NaN,TAIYOOB,NaN,25.0,2005-12-05
20,NaN,WILLABY,NaN,25.0,2005-12-05
25,NaN,JORDAN,NaN,171.0,2005-12-05
12,NaN,FRIERSON,NaN,44.0,2012-04-02
19,NaN,VALDES,NaN,10.0,2012-04-02
37,NaN,WELLERE,NaN,9.0,2012-04-02
15,NaN,SPURLIN,NaN,11.0,1994-08-01
21,NaN,STAUNTON,NaN,25.0,1980-10-01
32,NaN,ESCOBEDO,11877.0,NaN,2006-01-23
33,NaN,WILLIAMSON,NaN,10.0,1994-12-01

In [284]:
name_match = {}
no_name_match = {}
for lname, date in zip(matched_df.ACCUSEDOFFICER_LNAME, matched_df.ACCUSED_APPOINTMENT_DATE):
    if not all_sworn[(all_sworn.APPOINTED_DATE == date) &
                     (all_sworn.LAST_NME==lname)].empty:
        name_match[lname] = all_sworn[(all_sworn.APPOINTED_DATE == date) &
                                      (all_sworn.LAST_NME==lname)]
    else:
        no_name_match[lname] = all_sworn[all_sworn.APPOINTED_DATE == date]

In [285]:
name_match.keys()

dict_keys(['ESCOBEDO', 'CONNORS', 'EDWARDS', 'FORGUE'])

In [291]:
name_match['ESCOBEDO'][['FIRST_NME', 'CPD_UNIT_ASSIGNED_NO']]

     FIRST_NME  CPD_UNIT_ASSIGNED_NO
8019      LUIS                   6.0

In [286]:
no_name_match.keys()

dict_keys(['VALDES', 'JUDEH', 'SPURLIN', 'WELLERE', 'STAUNTON', 'WILLIAMSON', 'FRIERSON', 'JORDAN', 'TAIYOOB', 'WILLABY'])

** LAST_NAME = VALDES **

In [279]:
no_name_match['VALDES'].sort_values(by='LAST_NME')

,LAST_NME,FIRST_NME,MIDDLE_INITIAL,SEX_CODE_CD,RACE,DOBYEAR,CURRAGE,STATUS_I,APPOINTED_DATE,EMPLOYEE_POSITION_CD,...,STAR1,STAR2,STAR3,STAR4,STAR5,STAR6,STAR7,STAR8,STAR9,STAR10
18117,MC FADDEN JR,GARDNER,E,M,BLACK,1972.0,43.0,Y,1994-12-01,9161,...,4446.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

** LAST_NAME = JUDEH **

In [318]:
name = 'JUDEH'
temp = no_name_match[name]
temp[temp.CPD_UNIT_ASSIGNED_NO == 
     matched_df[matched_df.ACCUSEDOFFICER_LNAME==name].ACCUSED_UNIT.values[0]]

,LAST_NME,FIRST_NME,MIDDLE_INITIAL,SEX_CODE_CD,RACE,DOBYEAR,CURRAGE,STATUS_I,APPOINTED_DATE,EMPLOYEE_POSITION_CD,...,STAR1,STAR2,STAR3,STAR4,STAR5,STAR6,STAR7,STAR8,STAR9,STAR10
663,ANDRANGO JR,HERMAN,NaN,M,WHITE HISPANIC,1982.0,33.0,N,2012-10-05,9161,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
21177,OGOREK,JOSHUA,E,M,WHITE,1985.0,30.0,N,2012-10-05,9161,...,13800.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25013,RYCZEK,JONATHAN,J,M,WHITE,1987.0,28.0,N,2012-10-05,9161,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [302]:
temp.LAST_NME.unique()

array(['ALAGNO', 'ALMODOVAR', 'ANDERSON', 'ANDRANGO JR', 'ARCHER', 'AYALA',
       'BITTNER', 'BRUNO', 'CALDERON', 'CESPEDES', 'CHAVEZ', 'DELGADO',
       'DEMIROVIC', 'DIAZ', 'FELICIANO', 'FERLITO', 'FLORES', 'FUENTES',
       'GAINER', 'GANNON', 'GARCIA', 'GIANNIOTIS', 'GORZELANNY JR',
       'HERNANDEZ', 'HOTZA', 'HOWE III', 'KENAR', 'KILPONEN', 'KONICA',
       'KOPTERSKI', 'MCCANN', 'MCNICHOLAS', 'MEDINA', 'MIESZCAK', 'MILLER',
       'MIRANDA', 'MOLENSTRA', 'MORALES JR', 'OGOREK', 'PARISI', 'PAVONE',
       'PERAINO', 'PEREZ', 'POTTER', 'RAMEY', 'RANKIN', 'RENAULT',
       'RIALMO', 'RILEY', 'RODARTE', 'ROONEY', 'ROSE', 'ROSZKOWSKI',
       'RUSANOV', 'RYAN', 'RYCZEK', 'VERGIS', 'VINCENT'], dtype=object)

** LAST_NAME = SPURLIN **

In [317]:
name = 'SPURLIN'
temp = no_name_match[name]
temp[temp.CPD_UNIT_ASSIGNED_NO == 
     matched_df[matched_df.ACCUSEDOFFICER_LNAME==name].ACCUSED_UNIT.values[0]]

,LAST_NME,FIRST_NME,MIDDLE_INITIAL,SEX_CODE_CD,RACE,DOBYEAR,CURRAGE,STATUS_I,APPOINTED_DATE,EMPLOYEE_POSITION_CD,...,STAR1,STAR2,STAR3,STAR4,STAR5,STAR6,STAR7,STAR8,STAR9,STAR10
3691,CAMERON,GREGORY,V,M,BLACK,1965.0,50.0,N,1994-08-01,9161,...,9801.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
16879,MADDEN,MOLLY,E,F,WHITE,1967.0,48.0,Y,1994-08-01,9161,...,11525.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [307]:
temp.LAST_NME.unique()

array(['ANDERSEN', 'ANDERSON', 'ANTHONY', 'BACHLER', 'BARNES', 'BATISTE',
       'BELASCHKY', 'BLACHER', 'BLACK', 'BLEVINS', 'BOGGAN', 'BRIDGES',
       'BROWN', 'BRYJA', 'BRYSON', 'BURKE', 'CAMERON', 'CASALE JR',
       'CASEY', 'CATALDO', 'CEGIELSKI', 'CHAMPION', 'CHEVAS II', 'CLANCY',
       'CLARK', 'CLYNE', 'COLEMAN', 'COTTON', 'CZARNIK', 'DACANAY', 'DALY',
       'DANIELS', 'DAVIS', 'DEARTH', 'DELGADO', 'DEVINE', 'DORE', 'DUDLEY',
       'DUNN', 'EPINGER', 'FEENEY', 'FIORINO', 'FOGARTY', 'FRASURE',
       'FRONCZAK', 'GALVAN JR', 'GAMBOA', 'GARCIA', 'GARIBAY', 'GIBSON',
       'GIGLIO', 'GORDON', 'GRANIAS', 'GREEN', 'HALEEM', 'HARRIS',
       'HEGARTY', 'HERSEY', 'HICKS', 'HILL', 'HOLOWACH JR', 'HOOD',
       'HOOGLAND', 'HOULIHAN', 'HOZZIAN', 'HUNT', 'INGRAM JR', 'JABLONSKI',
       'JAEGER', 'JAGIELSKI', 'JOHNSON', 'KEEVERS', 'KIRBY', 'KNIGHT',
       'KREUZ', 'KRIARAKIS', 'LATHAM', 'LEE', 'LITTLE', 'LOPEZ', 'MADDEN',
       'MAINCZYK', 'MALECKI', 'MARSHALL', 'MATICH', 'MC ALLISTER',
       'MC FARLANE', 'MC GOVERN', 'MC GUIRE', 'MERCADO', 'MIJES', 'MINGO',
       'MOLINA', 'MOORE', 'MURPHY', 'MURPHY WEBB', 'NEGRETE JR', 'O KELLY',
       'OLIVIERI', 'PANYATHIP', 'PATNETT', 'PURDIMAN', 'PURTELL JR',
       'RAU JR', 'RIVERA', 'ROBERTS', 'RUDOLPH', 'SALERNO', 'SALINAS',
       'SALVAGE', 'SARTIN', 'SHAVERS JR', 'SHIELDS', 'SHIRAHAMA',
       'SIMONETTI', 'SIMZ', 'SKALA', 'SMITH', 'STANFORD', 'STANKOWSKI',
       'STANTON', 'SUTHERLAND', 'TALIAFERRO', 'TAYLOR', 'TEBBENS',
       'THOMAS JR', 'TROST', 'TUMAS', 'TURKS JR', 'VASQUEZ', 'VEGA', 'VIA',
       'VILLA', 'VILLAREAL', 'WALKER', 'WASHINGTON', 'WATSON', 'WEST',
       'WILLIAMS III', 'YOUNG', 'YZAGUIRRE', 'ZACEK', 'ZAYAS JR'], dtype=object)

** LAST_NAME = WELLERE **

In [319]:
name = 'WELLERE'
temp = no_name_match[name]
temp[temp.CPD_UNIT_ASSIGNED_NO == 
     matched_df[matched_df.ACCUSEDOFFICER_LNAME==name].ACCUSED_UNIT.values[0]]

Empty DataFrame
Columns: [LAST_NME, FIRST_NME, MIDDLE_INITIAL, SEX_CODE_CD, RACE, DOBYEAR, CURRAGE, STATUS_I, APPOINTED_DATE, EMPLOYEE_POSITION_CD, DESCR, CPD_UNIT_ASSIGNED_NO, UNITDESCR, RESIGNATION_DATE, STAR1, STAR2, STAR3, STAR4, STAR5, STAR6, STAR7, STAR8, STAR9, STAR10]
Index: []

[0 rows x 24 columns]

In [320]:
temp.LAST_NME.unique()

array(['KIRBY'], dtype=object)

In [321]:
temp

,LAST_NME,FIRST_NME,MIDDLE_INITIAL,SEX_CODE_CD,RACE,DOBYEAR,CURRAGE,STATUS_I,APPOINTED_DATE,EMPLOYEE_POSITION_CD,...,STAR1,STAR2,STAR3,STAR4,STAR5,STAR6,STAR7,STAR8,STAR9,STAR10
14690,KIRBY,BRANDON,H,M,WHITE,1987.0,28.0,Y,2012-04-02,9161,...,18291.0,13335.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

** LAST_NAME = STAUNTON **

In [322]:
name = 'STAUNTON'
temp = no_name_match[name]
temp[temp.CPD_UNIT_ASSIGNED_NO == 
     matched_df[matched_df.ACCUSEDOFFICER_LNAME==name].ACCUSED_UNIT.values[0]]

Empty DataFrame
Columns: [LAST_NME, FIRST_NME, MIDDLE_INITIAL, SEX_CODE_CD, RACE, DOBYEAR, CURRAGE, STATUS_I, APPOINTED_DATE, EMPLOYEE_POSITION_CD, DESCR, CPD_UNIT_ASSIGNED_NO, UNITDESCR, RESIGNATION_DATE, STAR1, STAR2, STAR3, STAR4, STAR5, STAR6, STAR7, STAR8, STAR9, STAR10]
Index: []

[0 rows x 24 columns]

In [323]:
temp

,LAST_NME,FIRST_NME,MIDDLE_INITIAL,SEX_CODE_CD,RACE,DOBYEAR,CURRAGE,STATUS_I,APPOINTED_DATE,EMPLOYEE_POSITION_CD,...,STAR1,STAR2,STAR3,STAR4,STAR5,STAR6,STAR7,STAR8,STAR9,STAR10
11417,HARPER,JERRY,NaN,M,BLACK,1948.0,68.0,N,1980-10-01,9161,...,5783.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

** LAST_NAME = WILLIAMSON **

In [324]:
name = 'WILLIAMSON'
temp = no_name_match[name]
temp[temp.CPD_UNIT_ASSIGNED_NO == 
     matched_df[matched_df.ACCUSEDOFFICER_LNAME==name].ACCUSED_UNIT.values[0]]

Empty DataFrame
Columns: [LAST_NME, FIRST_NME, MIDDLE_INITIAL, SEX_CODE_CD, RACE, DOBYEAR, CURRAGE, STATUS_I, APPOINTED_DATE, EMPLOYEE_POSITION_CD, DESCR, CPD_UNIT_ASSIGNED_NO, UNITDESCR, RESIGNATION_DATE, STAR1, STAR2, STAR3, STAR4, STAR5, STAR6, STAR7, STAR8, STAR9, STAR10]
Index: []

[0 rows x 24 columns]

In [325]:
temp

,LAST_NME,FIRST_NME,MIDDLE_INITIAL,SEX_CODE_CD,RACE,DOBYEAR,CURRAGE,STATUS_I,APPOINTED_DATE,EMPLOYEE_POSITION_CD,...,STAR1,STAR2,STAR3,STAR4,STAR5,STAR6,STAR7,STAR8,STAR9,STAR10
18117,MC FADDEN JR,GARDNER,E,M,BLACK,1972.0,43.0,Y,1994-12-01,9161,...,4446.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

**LAST_NAME = FRIERSON **

In [326]:
name = 'FRIERSON'
temp = no_name_match[name]
temp[temp.CPD_UNIT_ASSIGNED_NO == 
     matched_df[matched_df.ACCUSEDOFFICER_LNAME==name].ACCUSED_UNIT.values[0]]

Empty DataFrame
Columns: [LAST_NME, FIRST_NME, MIDDLE_INITIAL, SEX_CODE_CD, RACE, DOBYEAR, CURRAGE, STATUS_I, APPOINTED_DATE, EMPLOYEE_POSITION_CD, DESCR, CPD_UNIT_ASSIGNED_NO, UNITDESCR, RESIGNATION_DATE, STAR1, STAR2, STAR3, STAR4, STAR5, STAR6, STAR7, STAR8, STAR9, STAR10]
Index: []

[0 rows x 24 columns]

In [327]:
temp

,LAST_NME,FIRST_NME,MIDDLE_INITIAL,SEX_CODE_CD,RACE,DOBYEAR,CURRAGE,STATUS_I,APPOINTED_DATE,EMPLOYEE_POSITION_CD,...,STAR1,STAR2,STAR3,STAR4,STAR5,STAR6,STAR7,STAR8,STAR9,STAR10
14690,KIRBY,BRANDON,H,M,WHITE,1987.0,28.0,Y,2012-04-02,9161,...,18291.0,13335.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

** LAST_NAME = JORDAN **

In [328]:
name = 'JORDAN'
temp = no_name_match[name]
temp[temp.CPD_UNIT_ASSIGNED_NO == 
     matched_df[matched_df.ACCUSEDOFFICER_LNAME==name].ACCUSED_UNIT.values[0]]

Empty DataFrame
Columns: [LAST_NME, FIRST_NME, MIDDLE_INITIAL, SEX_CODE_CD, RACE, DOBYEAR, CURRAGE, STATUS_I, APPOINTED_DATE, EMPLOYEE_POSITION_CD, DESCR, CPD_UNIT_ASSIGNED_NO, UNITDESCR, RESIGNATION_DATE, STAR1, STAR2, STAR3, STAR4, STAR5, STAR6, STAR7, STAR8, STAR9, STAR10]
Index: []

[0 rows x 24 columns]

In [330]:
temp.LAST_NME.unique()

array(['AGUIRRE', 'ARMSTEAD', 'ARNOLD', 'BARTEL', 'BARTON', 'BARTUCCI',
       'BELCIK', 'BILES', 'BLECHARCZYK', 'BURLEIGH', 'CARLSON',
       'CARMICKLE', 'CLARK', 'CLAUDIO', 'CLYNE', 'COLON', 'CORRAL',
       'COUCH', 'CZARNIK', 'DE LA ROSA', 'DELANEY', 'DIBLICH', 'DOHERTY',
       'DUCAR', 'DUDZIK', 'EBERSOLE', 'FLOREK', 'GARCIA', 'GARNER',
       'GAWLOWSKI', 'GLYNN', 'GOLLOGLY', 'HALL', 'HARGROVE', 'HARRIS',
       'HILLARD', 'HOMER', 'HUMMONS', 'JACINTO', 'JAROSZ', 'JUNIOUS',
       'KISSANE', 'KLEIN', 'KRAL', 'KUMIGA', 'LAFRANCIS', 'LANGAN',
       'LEADER', 'LEHRMANN', 'LEIGHTON', 'LEON', 'LUND', 'MARASIGAN',
       'MARINO', 'MCALEER', 'MCBRIDE', 'MELLETT', 'MIKHAIL', 'MONTANARO',
       'MORRIS', 'MUDD', 'MURPHY', 'MUSGRAVES', 'NELLUM BRADLE', 'NICPON',
       'NIETO', 'NOWELLS', 'OLUGBALA', 'OSTROWSKI', 'PAPKE', 'PAUL',
       'PRUGER', 'RAMIREZ', 'RHODES', 'RIVERA', 'ROBIN', 'RODRIGUEZ',
       'ROMAN', 'SALYERS', 'SANCHEZ', 'SANDOMIERSKI', 'SANTIAGO',
       'SCHWARZER', 'SEBEK', 'SHIELDS', 'SIEDLECKI', 'SMITH', 'STEELE',
       'STENZEL', 'SUEN', 'SURGIT', 'SWEENEY', 'TOLEDO', 'TOTTAS',
       'TURNER', 'VALADEZ', 'VALENZUELA', 'VARGAS', 'VAZQUEZ', 'VEGA',
       'VITERI', 'WEBB', 'WESTCOTT', 'WHITTINGHAM', 'WILLIS', 'WINFREY',
       'WOOLSEY', 'ZAYAS', 'ZIEGLER'], dtype=object)

** LAST_NAME = WILLABY **

In [333]:
name = 'WILLABY'
temp = no_name_match[name]
temp[temp.CPD_UNIT_ASSIGNED_NO == 
     matched_df[matched_df.ACCUSEDOFFICER_LNAME==name].ACCUSED_UNIT.values[0]]

,LAST_NME,FIRST_NME,MIDDLE_INITIAL,SEX_CODE_CD,RACE,DOBYEAR,CURRAGE,STATUS_I,APPOINTED_DATE,EMPLOYEE_POSITION_CD,...,STAR1,STAR2,STAR3,STAR4,STAR5,STAR6,STAR7,STAR8,STAR9,STAR10
28592,TOLEDO,PETER,H,M,WHITE HISPANIC,1978.0,38.0,Y,2005-12-05,9171,...,15611.0,5411.0,2105.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [335]:
temp.LAST_NME.unique()

array(['AGUIRRE', 'ARMSTEAD', 'ARNOLD', 'BARTEL', 'BARTON', 'BARTUCCI',
       'BELCIK', 'BILES', 'BLECHARCZYK', 'BURLEIGH', 'CARLSON',
       'CARMICKLE', 'CLARK', 'CLAUDIO', 'CLYNE', 'COLON', 'CORRAL',
       'COUCH', 'CZARNIK', 'DE LA ROSA', 'DELANEY', 'DIBLICH', 'DOHERTY',
       'DUCAR', 'DUDZIK', 'EBERSOLE', 'FLOREK', 'GARCIA', 'GARNER',
       'GAWLOWSKI', 'GLYNN', 'GOLLOGLY', 'HALL', 'HARGROVE', 'HARRIS',
       'HILLARD', 'HOMER', 'HUMMONS', 'JACINTO', 'JAROSZ', 'JUNIOUS',
       'KISSANE', 'KLEIN', 'KRAL', 'KUMIGA', 'LAFRANCIS', 'LANGAN',
       'LEADER', 'LEHRMANN', 'LEIGHTON', 'LEON', 'LUND', 'MARASIGAN',
       'MARINO', 'MCALEER', 'MCBRIDE', 'MELLETT', 'MIKHAIL', 'MONTANARO',
       'MORRIS', 'MUDD', 'MURPHY', 'MUSGRAVES', 'NELLUM BRADLE', 'NICPON',
       'NIETO', 'NOWELLS', 'OLUGBALA', 'OSTROWSKI', 'PAPKE', 'PAUL',
       'PRUGER', 'RAMIREZ', 'RHODES', 'RIVERA', 'ROBIN', 'RODRIGUEZ',
       'ROMAN', 'SALYERS', 'SANCHEZ', 'SANDOMIERSKI', 'SANTIAGO',
       'SCHWARZER', 'SEBEK', 'SHIELDS', 'SIEDLECKI', 'SMITH', 'STEELE',
       'STENZEL', 'SUEN', 'SURGIT', 'SWEENEY', 'TOLEDO', 'TOTTAS',
       'TURNER', 'VALADEZ', 'VALENZUELA', 'VARGAS', 'VAZQUEZ', 'VEGA',
       'VITERI', 'WEBB', 'WESTCOTT', 'WHITTINGHAM', 'WILLIS', 'WINFREY',
       'WOOLSEY', 'ZAYAS', 'ZIEGLER'], dtype=object)